Revit 2024 API
BuiltInFailures.RoomFailures.RoomNotEnclosed Property
 [Room] is not in a properly enclosed region
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomNotEnclosed { get; }
Visual Basic
Public Shared ReadOnly Property RoomNotEnclosed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomNotEnclosed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace